Load_Balancer/test.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 50
      name: "Warm up the application"
    - duration: 20
      arrivalRate: 35
      name: "Sustained max load"
  defaults:
    headers:
      Authorization: 'Bearer 49c8f67b-147e-4d2d-941b-4ea60d997d18'
scenarios:
  - flow:
    - get:
        url: "/api/v1/users/1"
  - flow:
    - get:
        url: "/api/v1/users/1/history/2019-02-20"