Load_Balancer/test.yml
config:
  target: 'http://localhost:8070'
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 50
      name: "Warm up the application"
    - duration: 20
      arrivalRate: 50
      name: "Sustained max load"
  defaults:
    headers:
      Authorization: 'Bearer 02b08268-fb64-4e3b-a4b5-d0ad10aaebb7'
scenarios:
  - flow:
    - get:
        url: "/api/v1/users/1"
  - flow:
    - get:
        url: "/api/v1/users/1/history/2019-02-20"