Load_Balancer/test.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 10
      name: "Warm up the application (phase 1)"
    - pause: 10
    - duration: 20
      arrivalRate: 1
      rampTo: 35
      name: "Warm up the application (phase 2)"
    - pause: 10
    - duration: 10
      arrivalRate: 50
      name: "Sustained max load (phase 1)"
    - pause: 10
    - duration: 40
      arrivalRate: 50
      name: "Sustained max load (phase 2)"
  defaults:
    headers:
      Authorization: 'Bearer 6e12bdf5-7221-42b5-863c-0f0fa689ee30'
scenarios:
  - flow:
    - get:
        url: "/api/v1/users/1"
  - flow:
    - get:
        url: "/api/v1/users/1/history/2019-02-20"
  - flow:
    - get:
        url: "/api/v1/users/diet-requests"
  - flow:
    - get:
        url: "/api/v1/users/1/diet"