Load_Balancer/test.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 35
      name: "Warm up the application"
    - duration: 40
      arrivalRate: 60
      name: "Sustained max load"
  defaults:
    headers:
      Authorization: 'Bearer b50b6033-03ea-41d1-8219-9e3e1c1f089e'
scenarios:
  - flow:
    - get:
        url: "/api/v1/users/1"
  - flow:
    - get:
        url: "/api/v1/users/1/history/2019-02-20"
  - flow:
    - get:
        url: "/api/v1/users/diet-requests"
  - flow:
    - get:
        url: "/api/v1/users/1/diet"